<template>
  <div class="signing">
    <div
      v-for="(v, i) in signingLists" :key="v.id">
      <List :listData="v"/>
    </div>

    <!--    分页-->
    <Pagination @currentChange="currentChange" />

  </div>
</template>

<script>
  import List from "./List";
  import Pagination from "./Pagination";

  export default {
    name: "signing",
    components: {
      List,
      Pagination
    },
    data () {
      return {
        signingLists: [
          {
            id: 0,
            img_url: require('../../assets/imgs/list_1.png'),
            title: '看中国2019设计需求策划标准--1',
            sub_title: '做设计（包括规划景观），打造“某国风情园林”这样的设计思路是会首先被枪毙的。因为我们认为这样的打造是没有意义的。首先，我们的设计人员都没有到过“某国”；再者，如上文所说的，这样的风情园林并不是单靠一个楼盘项目的园林环境就能够支撑的。看中国2019设计需求策划标准'
          },
          {
            id: 1,
            img_url: require('../../assets/imgs/list_1.png'),
            title: '看中国2019设计需求策划标准--2',
            sub_title: '做设计（包括规划景观），打造“某国风情园林”这样的设计思路是会首先被枪毙的。因为我们认为这样的打造是没有意义的。首先，我们的设计人员都没有到过“某国”；再者，如上文所说的，这样的风情园林并不是单靠一个楼盘项目的园林环境就能够支撑的。看中国2019设计需求策划标准'
          },
          {
            id: 2,
            img_url: require('../../assets/imgs/list_1.png'),
            title: '看中国2019设计需求策划标准--3',
            sub_title: '做设计（包括规划景观），打造“某国风情园林”这样的设计思路是会首先被枪毙的。因为我们认为这样的打造是没有意义的。首先，我们的设计人员都没有到过“某国”；再者，如上文所说的，这样的风情园林并不是单靠一个楼盘项目的园林环境就能够支撑的。看中国2019设计需求策划标准'
          },
          {
            id: 3,
            img_url: require('../../assets/imgs/list_1.png'),
            title: '看中国2019设计需求策划标准--4',
            sub_title: '做设计（包括规划景观），打造“某国风情园林”这样的设计思路是会首先被枪毙的。因为我们认为这样的打造是没有意义的。首先，我们的设计人员都没有到过“某国”；再者，如上文所说的，这样的风情园林并不是单靠一个楼盘项目的园林环境就能够支撑的。看中国2019设计需求策划标准'
          },
          {
            id: 4,
            img_url: require('../../assets/imgs/list_1.png'),
            title: '看中国2019设计需求策划标准--5',
            sub_title: '做设计（包括规划景观），打造“某国风情园林”这样的设计思路是会首先被枪毙的。因为我们认为这样的打造是没有意义的。首先，我们的设计人员都没有到过“某国”；再者，如上文所说的，这样的风情园林并不是单靠一个楼盘项目的园林环境就能够支撑的。看中国2019设计需求策划标准'
          },
          {
            id: 5,
            img_url: require('../../assets/imgs/list_1.png'),
            title: '看中国2019设计需求策划标准--6',
            sub_title: '做设计（包括规划景观），打造“某国风情园林”这样的设计思路是会首先被枪毙的。因为我们认为这样的打造是没有意义的。首先，我们的设计人员都没有到过“某国”；再者，如上文所说的，这样的风情园林并不是单靠一个楼盘项目的园林环境就能够支撑的。看中国2019设计需求策划标准'
          },
          {
            id: 6,
            img_url: require('../../assets/imgs/list_1.png'),
            title: '看中国2019设计需求策划标准--7',
            sub_title: '做设计（包括规划景观），打造“某国风情园林”这样的设计思路是会首先被枪毙的。因为我们认为这样的打造是没有意义的。首先，我们的设计人员都没有到过“某国”；再者，如上文所说的，这样的风情园林并不是单靠一个楼盘项目的园林环境就能够支撑的。看中国2019设计需求策划标准'
          },
          {
            id: 7,
            img_url: require('../../assets/imgs/list_1.png'),
            title: '看中国2019设计需求策划标准--8',
            sub_title: '做设计（包括规划景观），打造“某国风情园林”这样的设计思路是会首先被枪毙的。因为我们认为这样的打造是没有意义的。首先，我们的设计人员都没有到过“某国”；再者，如上文所说的，这样的风情园林并不是单靠一个楼盘项目的园林环境就能够支撑的。看中国2019设计需求策划标准'
          },
          {
            id: 8,
            img_url: require('../../assets/imgs/list_1.png'),
            title: '看中国2019设计需求策划标准--9',
            sub_title: '做设计（包括规划景观），打造“某国风情园林”这样的设计思路是会首先被枪毙的。因为我们认为这样的打造是没有意义的。首先，我们的设计人员都没有到过“某国”；再者，如上文所说的，这样的风情园林并不是单靠一个楼盘项目的园林环境就能够支撑的。看中国2019设计需求策划标准'
          },
          {
            id: 9,
            img_url: require('../../assets/imgs/list_1.png'),
            title: '看中国2019设计需求策划标准--10',
            sub_title: '做设计（包括规划景观），打造“某国风情园林”这样的设计思路是会首先被枪毙的。因为我们认为这样的打造是没有意义的。首先，我们的设计人员都没有到过“某国”；再者，如上文所说的，这样的风情园林并不是单靠一个楼盘项目的园林环境就能够支撑的。看中国2019设计需求策划标准'
          }
        ]
      }
    },
    methods: {
      currentChange () {
        console.log('翻页')
      }
    }
  }
</script>

<style scoped>

</style>
